**BBM473 Database Laboratory (Spring 2019-2020)**


Exercise 3: More on SQL
-----

Please run the below cells first before proceeding- you'll need them soon!

In [ ]:
%load_ext sql
%sql sqlite://

In [ ]:
%%sql
DROP TABLE IF EXISTS Movies;
CREATE TABLE Movies(title VARCHAR(50), year INT, director VARCHAR(50), length INT);
INSERT INTO Movies VALUES('Database Wars', 1967, 'John Joe', 123);
INSERT INTO Movies VALUES('The Databaser', 1992, 'John Bob', 190);
INSERT INTO Movies VALUES('Database Wars', 1998, 'John Jim', 176);

In [ ]:
%sql DROP TABLE IF EXISTS A; DROP TABLE IF EXISTS B;
%sql CREATE TABLE A (x int, y int); CREATE TABLE B (x int, y int);
for i in range(1,6):
    %sql INSERT INTO A VALUES (:i, :i+1)
for i in range(1,11,3):
    %sql INSERT INTO B VALUES (:i, :i+2)

Activity 3-1:
------------

ORDER BY semantics, set operators & nested queries

In [ ]:
%sql SELECT * FROM movies

Task #1
-----------

**Can you write the movie query below as a single SFW query?**

Recall that we are trying to find **all movie titles that were used for more than one movie.** You may assume that no two movies in the same year have the same title. Our schema for the `movies` table is:

> * title STRING
> * year INT
> * director STRING
> * length INT

Let's try to write the nested query that solves this:

In [ ]:
%%sql
SELECT m.title 
FROM Movies m
WHERE m.year <> ANY(SELECT year FROM Movie WHERE title = m.title);

What?  This doesn't work?  Why?

**ANY doesn't exist in SQLite!**  Can we do this query without nesting?  Write your query here:

Task #2
--------------------

Consider the two relations $A$ and $B$ below:

In [ ]:
%sql SELECT * FROM A;

In [ ]:
%sql SELECT * FROM B;

Assuming no duplicates, can you write an `INTERSECT` query, **just over the $x$ attribute**, without using `INTERSECT` OR nested queries?  Write your query here:

What is this operation called?

Next, using set operators again as well, can you return all the _full_ tuples in $A$ and $B$ that overlap in $x$ attributes?  Write your query here:

Execute the code below:

In [ ]:
%sql sqlite:///dataset_1.db

Activity 3-2
------------
Aggregation operators, GROUP BY

Task #1
-----------

Consider a set of tables that describe the up-and-coming bagel startup industry; for now let's just look at two tables here, `bagel`, which describes types of bagels made by the different bagel companies:
> * name STRING
> * price FLOAT
> * made_by STRING

And `purchase`:
> * bagel_name STRING
> * franchise STRING
> * date INT
> * quantity INT
> * purchaser_age INT

Where `purchase.bagel_name` references `bagel.name` and `purchase.franchise` references `bagel.made_by`:

In [ ]:
%sql SELECT * FROM bagel LIMIT 3;

In [ ]:
%sql SELECT * FROM purchase LIMIT 3;

Can you write a query to get the _total revenue_ for each bagel type **which had an average purchaser age over 18**?  Type your query below:

Task #2
-----------

Here we'll use a simplified version of the `precipitation_full` table, which just has _daily_ rainfall _in CA only_, and has the following schema:

> * station_id
> * day
> * precipitation

In [ ]:
%sql SELECT * FROM precipitation LIMIT 5;

We want to get station_ids which have average precipitations > 75.  Try doing this first as a nested query:

Now, try re-writing as a GROUP BY:

Now time it by using `%time` followed by single-line versions of your queries above (clunky, but will work) to see how they compare!

**Note:** Yes, currently the answers are filled in below for convenience... but you should still try getting them on your own above!

In [ ]:
%%time 
%%sql 
SELECT DISTINCT p.station_id 
FROM precipitation p 
WHERE (SELECT AVG(precipitation) FROM precipitation WHERE station_id = p.station_id) > 75;

In [ ]:
%time %sql SELECT p.station_id FROM precipitation p GROUP BY p.station_id HAVING AVG(p.precipitation) > 75;

**An ~ 10-20x difference in execution time!!**

Activity 3-3
------------
Quantifiers, NULLs, and Outer Joins

Task #1
-----------

Recall that the tables we just looked at:

`bagel`, which describes types of bagels made by the different bagel companies:
> * name STRING
> * price FLOAT
> * made_by STRING

And `purchase`:
> * bagel_name STRING
> * franchise STRING
> * date INT
> * quantity INT
> * purchaser_age INT

Where `purchase.bagel_name` references `bagel.name` and `purchase.franchise` references `bagel.made_by`.

**Can you find out if there were any purchases of products not on one of the company's official lists (i.e. the `bagel` table), using a single SQL query?**

Write your query here: